In [1]:
#importinf pandas for all answers
import pandas as pd

## Q1. List any five functions of the pandas library with execution.
### Ans: List of any five functions of pandas library :
1. head() : This function helps you to get the first few rows of the dataset. By default, it returns the first 5 rows. However, you can change this number by simply mentioning the desired number of rows in df.head()
1. tail() : This function helps you to get the last few rows of the dataset. By default, it returns the last 5 rows, and similar to .head(), you can simply mention the desired number of rows in df.tail()
1. info() : This function returns a quick summary of the DataFrame. This includes information about column names and their respective data types, missing values, and memory consumption by DataFrame, as shown below.
1. describe() : This function returns descriptive statistics about the data. This includes minimum, maximum, mean (central tendency), standard deviation (dispersion) of the values in numerical columns, and the count of all non-null values in the data
1. unique() : This function returns the list of unique values in a column or series. Instead of applying on complete DataFrame, it works only on the selected single column.
1. df.value_counts() :This function returns — how many times a value appeared in a column. So, you need to pass the specific column name to this function

In [4]:
df1 = pd.read_csv("https://raw.githubusercontent.com/17rsuraj/data-curious/master/TowardsDataScience/Dummy_Sales_Data_v1.csv")

In [5]:
### head()
df1.head(4)

,OrderID,Quantity,UnitPrice(USD),Status,OrderDate,Product_Category,Sales_Manager,Shipping_Cost(USD),Delivery_Time(Days),Shipping_Address,Product_Code,OrderCode
0,2951110000999929511,92,238,Not Delivered,2021-08-08,Healthcare,Pablo,21,25.0,Singapore,HC-188,444116
1,2181910000999921819,61,136,Not Delivered,2021-10-03,Office,Pablo,34,14.0,UK,O-555,444772
2,3239110000999932391,67,235,Not Delivered,2021-09-27,Office,Kristen,25,11.0,Kenya,O-188,444666
3,1112610000999911126,33,133,Not Shipped,2021-07-30,Fashion,Abdul,34,24.0,USA,F-555,444007

In [6]:
df1.tail(4)

,OrderID,Quantity,UnitPrice(USD),Status,OrderDate,Product_Category,Sales_Manager,Shipping_Cost(USD),Delivery_Time(Days),Shipping_Address,Product_Code,OrderCode
9995,1847410000999918474,37,135,Shipped,2021-10-03,Healthcare,Maria,30,23.0,China,HC-901,444772
9996,2385710000999923857,81,207,Delivered,2021-11-13,Office,Emma,29,18.0,USA,O-203,445113
9997,2281610000999922816,18,117,Shipped,2021-12-23,Fashion,Stella,22,24.0,Italy,F-101,445553
9998,1468010000999914680,53,229,Delivered,2021-07-12,Entertainment,Anthony,25,12.0,Singapore,ENT-630,443889

In [10]:
df1['OrderID'].unique()

array([2951110000999929511, 2181910000999921819, 3239110000999932391, ...,
       1847410000999918474, 2281610000999922816, 1468010000999914680])

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9999 entries, 0 to 9998
Data columns (total 12 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   OrderID              9999 non-null   int64
 1   Quantity             9999 non-null   int64
 2   UnitPrice(USD)       9999 non-null   int64
 3   Status               9999 non-null   object
 4   OrderDate            9999 non-null   object
 5   Product_Category     9963 non-null   object
 6   Sales_Manager        9999 non-null   object
 7   Shipping_Cost(USD)   9999 non-null   int64
 8   Delivery_Time(Days)  9948 non-null   float64
 9   Shipping_Address     9999 non-null   object
 10  Product_Code         9999 non-null   object
 11  OrderCode            9999 non-null   int64
dtypes: float64(1), int64(5), object(6)
memory usage: 937.5+ KB

In [12]:
df1.describe()

,OrderID,Quantity,UnitPrice(USD),Shipping_Cost(USD),Delivery_Time(Days),OrderCode
count,9.999000e+03,9999.000000,9999.000000,9999.000000,9948.000000,9999.000000
mean,3.020951e+18,50.739874,175.620662,27.571857,17.518396,444682.917392
std,1.167549e+18,29.005532,43.527995,4.610452,4.609531,525.343171
min,1.010010e+18,1.000000,100.000000,20.000000,10.000000,443880.000000
25%,2.010410e+18,26.000000,138.000000,24.000000,14.000000,444222.000000
50%,3.002410e+18,51.000000,176.000000,28.000000,18.000000,444772.000000
75%,4.024510e+18,76.000000,213.000000,32.000000,22.000000,445113.000000
max,5.049610e+18,100.000000,250.000000,35.000000,25.000000,445660.000000

In [13]:
df1.value_counts()

OrderID              Quantity  UnitPrice(USD)  Status         OrderDate   Product_Category  Sales_Manager  Shipping_Cost(USD)  Delivery_Time(Days)  Shipping_Address  Product_Code  OrderCode
1010010000999910100  10        101             Shipped        2021-10-16  Healthcare        Jacob          35                  14.0                 Germany           HC-188        444885       1
3691010000999936910  35        169             Not Delivered  2021-10-17  Office            Pablo          21                  21.0                 Kenya             O-630         444886       1
3687210000999936872  69        132             Not Shipped    2021-08-08  Office            Anthony        21                  12.0                 China             O-901         444116       1
3687510000999936875  75        169             Shipped        2021-07-04  Home              Jacob          23                  11.0                 India             H-203         443881       1
3688410000999936884  59        229             Not Shipped    2021-09-14  Home              Abdul          34                  16.0                 UK                H-555         444553       1
                                                                                                                                                                                                ..
2348210000999923482  69        175             Not Shipped    2021-09-30  Entertainment     Abdul          23                  10.0                 China             ENT-901       444669       1
2348510000999923485  66        243             Delivered      2021-11-11  Healthcare        Sofia          33                  21.0                 Italy             HC-101        445111       1
2348810000999923488  11        142             Shipped        2021-07-03  Fashion           John           35                  24.0                 Singapore         F-101         443880       1
2349110000999923491  78        193             Not Delivered  2021-12-23  Entertainment     Emma           32                  16.0                 USA               ENT-101       445553       1
5049610000999950496  73        248             Shipped        2021-10-17  Office            Abdul          28                  15.0                 UK                O-101         444886       1
Length: 9912, dtype: int64

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.
### Ans:

In [4]:
df2 = pd.DataFrame({"A":[10,0,30],"B":[11,12,13],"C":[21,22,23]})
df2

    A   B   C
0  10  11  21
1   0  12  22
2  30  13  23

In [5]:
# def Reindex_Df(df):
#     df.index = pd.Index(range(1, len(df)*2, 2))
#     return df

def Reindex_Df(df):
    new_index = pd.Index(range(1, 2*len(df)+1, 2), name='new_index')
    return df.set_index(new_index)

In [6]:
Reindex_Df(df2)

            A   B   C
new_index
1          10  11  21
3           0  12  22
5          30  13  23

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column.The function should print the sum to the console.For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.
### Ans:

In [14]:
df3 = pd.DataFrame({"Values":[10,20,30,40,50]})

# for sum of furst 3 values we have to create a function
# def Sum_Df(df):
    # total = 0
    # count = 0
    # for i in df['Values']:
    #     if count < 3:
    #         total += i
    #         count += 1
    #     else:
    #         break
    # print(total)

# using iterrows()
def Sum_Df(df):
    sum = 0
    for i, row in df.iterrows():
        if i < 3:
            sum += row['Values']
        else:
            break
    print(f"Sum of the first three values in the 'Values' column: {sum}")

In [13]:
Sum_Df(df3)

Sum of the first three values in the 'Values' column: 60

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.
### Ans:

In [15]:
df4 = pd.DataFrame({"Text":["hi my name is aniruddha","i am from nanded","learning Data Science","little bit hard but enjoying","nanded is a part of mahrashtra","bybyb bye"]})

# for counting words from text column 
def Text_Count(df):
    df['Word_Count'] = df['Text'].apply(lambda x: len(x.split())) # spliting words by blankspace
    return df

In [16]:
Text_Count(df4)

                             Text  Word_Count
0         hi my name is aniruddha           5
1                i am from nanded           4
2           learning Data Science           3
3    little bit hard but enjoying           5
4  nanded is a part of mahrashtra           6
5                       bybyb bye           2

## Q5. How are DataFrame.size() and DataFrame.shape() different?
### Ans:
* DataFrame.size() : DataFrame.size returns the total number of elements in the DataFrame. This is calculated as the product of the number of rows (DataFrame.shape[0]) and the number of columns (DataFrame.shape[1]). In other words, DataFrame.size returns the total number of cells in the DataFrame, including empty cells.

* DataFrame.shape() : DataFrame.shape returns a tuple containing the number of rows and columns in the DataFrame. The number of rows is the first element of the tuple (DataFrame.shape[0]), and the number of columns is the second element (DataFrame.shape[1]).

## Q6. Which function of pandas do we use to read an excel file?
### Ans:
* To read an Excel file in Pandas, you can use the read_excel() function. This function is part of the pandas module and can read Excel files in various formats, including .xls and .xlsx. Here's an example of how to use the read_excel() function: df = pd.read_excel('file.xlsx')

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.
### Ans:

In [42]:
df7 = pd.DataFrame({"Email":["aniruddhakokate777@gmail.com"]})
def Get_Username(df):
    df7['Username'] = df7['Email'].apply(lambda i: (i.split("@")[0])) # spliting words by @
    return df7

                          Email
0  aniruddhakokate777@gmail.com

In [48]:
Get_Username(df7)

                          Email            Username
0  aniruddhakokate777@gmail.com  aniruddhakokate777

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10.The function should return a new DataFrame that contains only the selected rows.
* For example, if df contains the following values: (
  A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2)
Your function should select the following rows: 
  A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.
### ANS:

In [12]:
df8 = pd.DataFrame({"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]})

def Show_DF(df):
    rows = df8[(df8['A']>5) & (df8['B'] < 10)]
    return rows

In [13]:
Show_DF(df8)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,median, and standard deviation of the values in the 'Values' column.
### Ans:

In [15]:
df9 = pd.DataFrame({"Values":[1,2,8,6,5,2,8,9,3,1,5,6,8,10,25]})
df9.describe() # using describe

          Values
count  15.000000
mean    6.600000
std     5.889458
min     1.000000
25%     2.500000
50%     6.000000
75%     8.000000
max    25.000000

In [17]:
# using mean(),median(),stdev()
def Calulation_Of_Values(df):
    values = df['Values']
    mean = values.mean()
    median = values.median()
    std = values.std()
    return mean, median, std
Calulation_Of_Values(df9)

(6.6, 6.0, 5.889457894043754)

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.
### Ans:

In [15]:
# create example DataFrame
df10 = pd.DataFrame({'Values': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]})

# calculate rolling average with window size of 7
moving_avg = df10['Values'].rolling(window=7).mean()

# print the DataFrame with the moving average values
print(moving_avg)

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6    40.0
7    50.0
8    60.0
9    70.0
Name: Values, dtype: float64

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.Monday, Tuesday) corresponding to each date in the 'Date' column.For example, if df contains the following values:
  Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

  Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [2]:
def add_weekday_column(df):
    df['Weekday'] = df['Date'].dt.day_name()
    return df

In [4]:
df11 = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})
df11['Date'] = pd.to_datetime(df11['Date'])
df11 = add_weekday_column(df11)
print(df11)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.
### Ans:

In [5]:
def select_january_rows(df):
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    selected_rows = df.loc[mask]
    return selected_rows

df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-02-01']})
df['Date'] = pd.to_datetime(df['Date'])
selected_rows = select_january_rows(df)
print(selected_rows)

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?
### Ans: The first and foremost necessary library that needs to be imported to use the basic functions of pandas is pandas itself.
* import pandas as pd